#### Terraform Plan
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.codebuild.data.archive_file.code_build_package will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "code_build_package" {
      + excludes            = [
          + "wordpress_docker.zip",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/codebuild/codebuild_files/wordpress_docker.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/codebuild/codebuild_files/"
      + type                = "zip"
    }

  # module.codebuild.aws_s3_object.wordpress_dockerbuild will be updated in-place
  ~ resource "aws_s3_object" "wordpress_dockerbuild" {
      ~ etag                          = "5a8bda34899097316fd956643fcc340d" -> (known after apply)
        id                            = "wordpress_docker.zip"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.codebuild.local_file.php_ini will be created
  + resource "local_file" "php_ini" {
      + content              = <<-EOT
            upload_max_filesize=64M
            post_max_size=64M
            max_execution_time=0
            max_input_vars=2000
            memory_limit=512M
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/codebuild/codebuild_files/php.ini"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ codebuild_package_etag   = "5a8bda34899097316fd956643fcc340d" -> (known after apply)

```
</details>